<template>
  <div class="result" v-if="this.type">
    <h2>{{this.type+"、"+this.result[this.type].conclude}}</h2>
    <p>{{this.result[this.type].msg}}</p>
  </div>

</template>

<script>
  export default {
    name: "result",
    data: function (){
      return {
        type: "",
        result: {
          A: {
            conclude: "你很不会聊天，典型的话题终结者",
            msg: "生活中你是一个性格直率，说话常常不经过大脑的直肠子。看不惯的事物你会直截了当的指出，不给任何迂回和转折。不善于察言观色也是你的一大缺点，因为自己的失误导致气氛尴尬，你也会不自知。在你的世界里聊天就是一种商议，不需要在乎氛围，只需要表述自己的观点，也不需要关注对方的态度。当你们聊到意见相左的时候也会发生争论。任何话题你都想要参与，不关心对方是否感兴趣，或者触及到对方的隐私。你的口无遮拦在很多时候会导致尬聊，很不会聊天的你，也是典型的话题终结者！"
          },
          B: {
            conclude: "你不太会聊天，不算是话题终结者",
            msg: "人情世故不属于你的长项，你也不太善于聊天，但是看到大家都聊得热火朝天，你也很强参与。准确的来说你更加喜欢参与话题，而非开启话题，因为你是一个性格比较内向的人，主动找人聊天还是觉得不自在。如果在特定的环境下，为了避免尴尬你也会主动聊天，只是很不会找话题和说开场白的你，特别容易造成尬聊，让对方不知道如果接话。虽不算是话题终结者，但是你也要改善的开朗一点，脸皮厚一点，就什么事都敢往下聊了！"
          },
          C: {
            conclude: "你还算会聊天，不会是话题终结者",
            msg: "察言观色说来简单，但在为人处世的时候还是很难拿捏的。你是一个善于洞察的人，在和人聊天的时候，你不仅会关注话题，还会关注对方的情绪变化。就算做不到见人说人话，见鬼说鬼话，你也不会说出倒胃口的话，让对方无言以对。一次好的聊天就像吃到了一道美味可口的饭菜，不仅填饱了肚子，还满足了味蕾。所以，你还算是很对聊天的人，也很难出现尬聊的状态，和你在一起聊天也算是轻松愉快的！"
          },
          D: {
            conclude: "你很会聊天，不可能是话题终结者",
            msg: "理性的你是一个头脑清晰的人，这并不代表你是冷漠的，因为情商高，所以也会懂得如何去社交。和别人聊天你很懂得掌握度，不仅会说，还会听。不仅会关注节奏，还会尊重对方的想法。在你看来，聊天不是无聊时候打发时间的利器，而是了解一个人，发现问题的契机。很好的利用一次聊天，可以吸收很多知识和见解，还能让自己放松。和你聊天会让你觉得你思路清晰，你懂得聆听，还善于分析，和你聊天就是一次自我认识的升华。"
          }
        }
      }
    },
    created: function (){
      this.type = this.$store.state.result;
    }
  }
</script>

<style lange="scss">
  .result{
    margin-top: 40%;
    padding: 0 20px;
    p{
      text-indent: 20px;
    }
  }
</style>
